packages/cf-boot/cf-boot-1.12.1.tar.gz/cf-boot-1.12.1/cfboot/scripts/create-unique-cf-home/README.org
#+OPTIONS: ^:nil
#+OPTIONS: toc:nil
#+OPTIONS: html-postamble:nil
#+OPTIONS: num:nil
#+TITLE: create-unique-cf-home

* Inputs
 - c api endpoint, cf user
   | *arg name*   | *JSON type* | *example*                                 | *description*                                           |
   | CF_TARGET    | string      | "https://api.system.asv-pr.ice.predix.io" | cf api endpoint                                         |
   | CF_USER      | string      | "service.hubsservice@ge.com"              | cf username                                             |
   |              |             |                                           |                                                         |
 - password options
   1.
     | CF_PASSWORD     | string | "***REMOVED***" | cf password           |
   -
     | CF_SSO_PASSCODE | string | "***REMOVED***" | non-interactive one-time sso passcode |
   - if nothing provided, interactively prompt for sso passcode
 - org/space options
   -
    | *arg name* | *JSON type* | *example* | *description* |
    | CF_ORG     | string      | "HUBS"    | cf org        |
    | CF_SPACE   | string      | "dev"     | cf space      |
   - OR
    | *arg name*   | *JSON type* | *example*  | *description*                                  |
    | CF_ORG_SPACE | string      | "HUBS/dev" | slash-delimited combination of CF_ORG/CF_SPACE |
** Examples:
   #+BEGIN_SRC js
   {
    "CF_TARGET": "https://api.system.asv-pr.ice.predix.io",
    "CF_PASSWORD": "***REMOVED***",
    "CF_USER": "service.hubsservice@ge.com",
    "CF_ORG_SPACE": "HUBS/dev"
   }
   #+END_SRC

* Output
  | *output name* | *JSON type* | *example*             | *description* |
  | CF_HOME       | string      | "/tmp/cf-home-913530" | path to login-issued CF_HOME |

** Example:
   #+BEGIN_SRC js
   {"CF_HOME": "/tmp/cf-home-913530"}
   #+END_SRC

* Idempotence
  The script may be called any number of times. It will create a new unique throwaway directory under /tmp and issue a cf login
