packages/cf-boot/cf-boot-1.13.0.tar.gz/cf-boot-1.13.0/cfboot/scripts/create-unique-cf-home/README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>create-unique-cf-home</title>
<!-- 2018-01-08 Mon 11:36 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Ernesto Alfonso" />
</head>
<body>
<div id="content">
<h1 class="title">create-unique-cf-home</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Inputs</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>c api endpoint, cf user
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left"><b>arg name</b></td>
<td class="left"><b>JSON type</b></td>
<td class="left"><b>example</b></td>
<td class="left"><b>description</b></td>
</tr>

<tr>
<td class="left">CF_TARGET</td>
<td class="left">string</td>
<td class="left">"<a href="https://api.system.asv-pr.ice.predix.io">https://api.system.asv-pr.ice.predix.io</a>"</td>
<td class="left">cf api endpoint</td>
</tr>

<tr>
<td class="left">CF_USER</td>
<td class="left">string</td>
<td class="left">"service.hubsservice@ge.com"</td>
<td class="left">cf username</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</li>
<li>password options
<ol class="org-ol">
<li><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">CF_PASSWORD</td>
<td class="left">string</td>
<td class="left">"<b><b><b>REMOVED</b></b></b>"</td>
<td class="left">cf password</td>
</tr>
</tbody>
</table>
</li>
<li><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">CF_SSO_PASSCODE</td>
<td class="left">string</td>
<td class="left">"<b><b><b>REMOVED</b></b></b>"</td>
<td class="left">non-interactive one-time sso passcode</td>
</tr>
</tbody>
</table>
</li>
<li>if nothing provided, interactively prompt for sso passcode
</li>
</ol>
</li>
<li>org/space options
<ul class="org-ul">
<li><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left"><b>arg name</b></td>
<td class="left"><b>JSON type</b></td>
<td class="left"><b>example</b></td>
<td class="left"><b>description</b></td>
</tr>

<tr>
<td class="left">CF_ORG</td>
<td class="left">string</td>
<td class="left">"HUBS"</td>
<td class="left">cf org</td>
</tr>

<tr>
<td class="left">CF_SPACE</td>
<td class="left">string</td>
<td class="left">"dev"</td>
<td class="left">cf space</td>
</tr>
</tbody>
</table>
</li>
<li>OR
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left"><b>arg name</b></td>
<td class="left"><b>JSON type</b></td>
<td class="left"><b>example</b></td>
<td class="left"><b>description</b></td>
</tr>

<tr>
<td class="left">CF_ORG_SPACE</td>
<td class="left">string</td>
<td class="left">"HUBS/dev"</td>
<td class="left">slash-delimited combination of CF_ORG/CF_SPACE</td>
</tr>
</tbody>
</table>
</li>
</ul>
</li>
</ul>
</div>
<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Examples:</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">

<pre class="src src-js">{
 "CF_TARGET": "https://api.system.asv-pr.ice.predix.io",
 "CF_PASSWORD": "***REMOVED***",
 "CF_USER": "service.hubsservice@ge.com",
 "CF_ORG_SPACE": "HUBS/dev"
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Output</h2>
<div class="outline-text-2" id="text-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left"><b>output name</b></td>
<td class="left"><b>JSON type</b></td>
<td class="left"><b>example</b></td>
<td class="left"><b>description</b></td>
</tr>

<tr>
<td class="left">CF_HOME</td>
<td class="left">string</td>
<td class="left">"/tmp/cf-home-913530"</td>
<td class="left">path to login-issued CF_HOME</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">Example:</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">

<pre class="src src-js">{"CF_HOME": "/tmp/cf-home-913530"}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Idempotence</h2>
<div class="outline-text-2" id="text-3">
<p>
The script may be called any number of times. It will create a new unique throwaway directory under /tmp and issue a cf login
</p>
</div>
</div>
</div>
</body>
</html>
